In [1]:
import numpy as np
import pandas as pd

In [6]:
data1 = {
"Indeks": [0, 1, 2, 3],
"Isim": ["Ahmet", "Mehmet", "Zeynep", "Atil"],
"Spor": ["Koşu", "Yüzme", "Koşu", "Basketbol"],
"Kalori": [100, 200, 300, 400]
}
df1 = pd.DataFrame(data1)

data2 = {
"Indeks": [4, 5, 6, 7],
"Isim": ["Osman", "Levent", "Atlas", "Fatma"],
"Spor": ["Koşu", "Yüzme", "Koşu", "Basketbol"],
"Kalori": [200, 100, 50, 300]
}
df2 = pd.DataFrame(data2)

data3 = {
"Indeks": [8, 9, 10, 11],
"Isim": ["Ayse", "Mahmut", "Duygu", "Nur"],
"Spor": ["Koşu", "Yüzme", "Badminton", "Tenis"],
"Kalori": [300, 400, 500, 250]
}
df3 = pd.DataFrame(data3)

Concatenation

In [7]:
#dataframe birleştirmek için kullanılır varsayılan axis 0 istersek 1 olarak değiştirebiliriz 
pd.concat([df1,df2,df3])

   Indeks    Isim       Spor  Kalori
0       0   Ahmet       Koşu     100
1       1  Mehmet      Yüzme     200
2       2  Zeynep       Koşu     300
3       3    Atil  Basketbol     400
0       4   Osman       Koşu     200
1       5  Levent      Yüzme     100
2       6   Atlas       Koşu      50
3       7   Fatma  Basketbol     300
0       8    Ayse       Koşu     300
1       9  Mahmut      Yüzme     400
2      10   Duygu  Badminton     500
3      11     Nur      Tenis     250

Merge

In [10]:
mergeSozluk1 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
                "Spor" : ["Kosu", "Yüzme", "Kosu", "Basketbol"],
               }

In [11]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [13]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Kosu
1  Mehmet      Yüzme
2  Zeynep       Kosu
3    Atıl  Basketbol

In [14]:
mergeSozluk2 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
                "Kalori" : [100,200,150,250],
               }

In [15]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [16]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [18]:
#merge dataframelerde birbirine uyumlu olması kaydıyla stünları birleştirir referans sütun on=seçilensütun olarak girilir
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yüzme     200
2  Zeynep       Kosu     150
3    Atıl  Basketbol     250

In [19]:
maasSozluk = {"Isim" : ["Atil","Zeynep","Mehmet","Ahmet"],
             "Departman" : ["Yazılım","Satıs","Pazarlama","Yazılım"],
             "Maas" : [200,300,400,500]
             }

In [20]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [21]:
maasDataFrame

     Isim  Departman  Maas
0    Atil    Yazılım   200
1  Zeynep      Satıs   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [26]:
#farklı olanları sıralar aynı olanları tekrar getirmez
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satıs', 'Pazarlama'], dtype=object)

In [27]:
#kaç departman var
maasDataFrame["Departman"].nunique()

3

In [29]:
#Hangi departmanda kaç kişi olduğunu getirir
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satıs        1
Pazarlama    1
Name: count, dtype: int64

In [38]:
maasDataFrame

     Isim  Departman  Maas
0    Atil    Yazılım   200
1  Zeynep      Satıs   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [39]:
def bruttenNete(maas):
   return maas * 0.27 + maas

In [40]:
#apply uygula demek bu örnekte maasDataFrame den maas sütnunu getir ve bruttenNete fonksiyonunu uygula diyoruz
maasDataFrame["Maas"].apply(bruttenNete)

0    254.0
1    381.0
2    508.0
3    635.0
Name: Maas, dtype: float64

In [41]:
#null değer var mı 
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [47]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson" ],
                "Karakter Ismi" : ["Cartman", "Kenny", "Homer","Bart"],
                "Karakter Yas" : [9,10,50,20]
              }

In [48]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [49]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [53]:
karakterDF.pivot_table(values = "Karakter Yas", index =["Karakter Sınıfı", "Karakter Ismi"],aggfunc = np.sum)

/var/folders/31/hn4_0l4s3rddk6y1ykr7hgym0000gn/T/ipykernel_57215/2737422148.py:1: FutureWarning: The provided callable <function sum at 0x1074445e0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  karakterDF.pivot_table(values = "Karakter Yas", index =["Karakter Sınıfı", "Karakter Ismi"],aggfunc = np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     20
                Homer                    50
South Park      Cartman                   9
                Kenny                    10